ðŸŸ¦ 1. Import Libraries & Create Sample Data

In [1]:
import pandas as pd
import numpy as np

# Sample dataset
df = pd.DataFrame({
    "City": ["Toronto", "Toronto", "Toronto", "Vancouver", "Vancouver", "Montreal"],
    "Month": ["Jan", "Jan", "Feb", "Jan", "Feb", "Feb"],
    "Sales": [120, 80, 150, 90, 50, 200],
    "Units": [10, 6, 12, 7, 5, 15]
})

df

        City Month  Sales  Units
0    Toronto   Jan    120     10
1    Toronto   Jan     80      6
2    Toronto   Feb    150     12
3  Vancouver   Jan     90      7
4  Vancouver   Feb     50      5
5   Montreal   Feb    200     15

ðŸŸ¦ 2. Basic Pivot Table (Single Aggregation)

In [2]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    aggfunc="sum"
)

           Sales
City
Montreal     200
Toronto      350
Vancouver    140

ðŸŸ¦ 3. Pivot Table with Multiple Aggregations

In [3]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    aggfunc=["sum", "mean", "count"]
)

            sum        mean count
          Sales       Sales Sales
City
Montreal    200  200.000000     1
Toronto     350  116.666667     3
Vancouver   140   70.000000     2

ðŸŸ¦ 4. Pivot with Multiple Index and Column Levels

In [4]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    columns="Month",
    aggfunc="sum"
)

Month        Feb    Jan
City
Montreal   200.0    NaN
Toronto    150.0  200.0
Vancouver   50.0   90.0

ðŸŸ¦ 5. Pivot with Multiple Value Columns

In [5]:
pd.pivot_table(
    df,
    values=["Sales", "Units"],
    index="City",
    aggfunc="sum"
)

           Sales  Units
City
Montreal     200     15
Toronto      350     28
Vancouver    140     12

ðŸŸ¦ 6. Pivot Table with Multiple Aggregations per Column

In [6]:
pd.pivot_table(
    df,
    values=["Sales", "Units"],
    index="City",
    aggfunc={"Sales": ["sum", "mean"], "Units": ["sum", "mean"]}
)

                Sales           Units
                 mean  sum       mean sum
City
Montreal   200.000000  200  15.000000  15
Toronto    116.666667  350   9.333333  28
Vancouver   70.000000  140   6.000000  12

ðŸŸ¦ 7. Handling Missing Values with fill_value

In [7]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    columns="Month",
    aggfunc="sum",
    fill_value=0
)

Month      Feb  Jan
City
Montreal   200    0
Toronto    150  200
Vancouver   50   90

ðŸŸ¦ 8. Adding Margins (Row & Column Totals)

In [8]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    columns="Month",
    aggfunc="sum",
    margins=True,
    margins_name="Total"
)

Month        Feb    Jan  Total
City
Montreal   200.0    NaN    200
Toronto    150.0  200.0    350
Vancouver   50.0   90.0    140
Total      400.0  290.0    690

ðŸŸ¦ 9. Pivot Table with Custom Function

In [9]:
pd.pivot_table(
    df,
    values="Sales",
    index="City",
    aggfunc=lambda x: x.max() - x.min()
)

           Sales
City
Montreal       0
Toronto       70
Vancouver     40

ðŸŸ¦ 10. Pivot Table Returning Percentages

In [10]:
table = pd.pivot_table(
    df,
    values="Sales",
    index="City",
    columns="Month",
    aggfunc="sum"
)

table.div(table.sum(axis=1), axis=0) * 100

Month             Feb        Jan
City
Montreal   100.000000        NaN
Toronto     42.857143  57.142857
Vancouver   35.714286  64.285714

## ðŸŸ¦ Summary 

You have fully covered 7.1 Pivot Tables with pivot_table()

This includes:

âœ” Basic pivot tables

âœ” Multi-level pivoting

âœ” Multiple aggregations

âœ” Handling missing values

âœ” Custom functions

âœ” Totals and percentages